<template>
  <page title="Page组件-自带页脚" :show-footer="true">
    <van-notice-bar
      wrapable
      :scrollable="false"
      text="按照正常逻辑来讲，一个项目的页脚基本上是不会变的，所以 Page 组件的页面是直接内置在组件中的，有需要的开发者可以在 src/components/Page/index.vue 中进行修改。"
    />
    <div class="content-wrap">
      <p>一、收起你的懦弱，摆出你的霸气，在你跌倒的时候没人扶你，多得是看你笑话的畜生！</p>
      <p>二、你不努力，永远不会有人对你公平，只有你努力了，有了资源，有了话语权以后，你才可能为自己争取公平的机会。</p>
      <p>三、没有行动，懒惰就会生根发芽！没有梦想，堕落就会生根发芽！时间越长，根就越深！到时候想站起来是件很困难的事！所以，为了很好的站着，就不要停下你的脚步！</p>
      <p>四、没有谁能击垮你，除非你自甘堕落。不拼一把，你怎么知道自己是人物还是废物！比你差的人没放弃，比你好的人仍在努力，你有什么资格说你无能为力！</p>
      <p>五、你不能决定太阳几点升起，但可以决定自己几点起床。你不能控制生命的长度，但可以增加生命的宽度。别嫉妒别人的成功，在你看不见的时候，他们流下了你想象不到的汗水。与其羡慕，不如奋斗！</p>
      <p>六、敢闯才有机会！敢拼才有未来！人的一辈子没有一帆风顺！雨再大，也有停的时候！再大的乌云也遮不住微笑的太阳！不苦不累人生无味！不拼不博人生白活！</p>
      <p>七、当你又瘦又好看，钱包里都是自己努力赚来的钱的时候，你就会恍然大悟，哪有时间患得患失，哪有时间猜东猜西，哪有时间揣摩别人，你若盛开，蝴蝶自来，你若精彩，天自安排。</p>
      <p>八、就算全世界都否定你，你也要相信你自己，不要去想别人的看法，别人的话不过是阳光里的尘埃，下一秒就被风吹走。</p>
      <p>九、生活不能等待别人来安排，要自己去争取和奋斗；而不论其结果是喜是悲，但可以慰藉的是，你总不枉在这世界上活了一场。</p>
      <p>十、与其逃避现实，不如笑对人生。不管多远的路，也能走到尽头；保持一颗平和的心态，怀揣一个梦想，不畏惧风雨，不害怕失败，敢于行动，去追寻那个渐行渐远快要消失的自我。</p>
      <p>十一、人生就是一只储蓄罐，你投入的每一分努力，都会在未来的某一天，打包还给你。别人拥有的，你只要愿意去付出，一样可以拥有。</p>
      <p>十二、生活是自己的，你选择怎样的生活，就会成就怎样的你。与其抱怨这个世界不美好，不如用自己的努力，争取更多的美好和幸运。</p>
      <p>十三、最终你相信什么，就能成为什么。因为世界上最可怕的两个词，一个叫执着，一个叫认真，认真的人改变自己，执着的人改变命运。只要在路上，就没有到不了的地方。</p>
      <p>十四、不想认命，就去拼命！付出就会有收获，或大或小，或迟或早，始终不会辜负你的努力！有一种落差是，你总是羡慕别人的成功，自己却不敢开始！立即行动，永远不晚！</p>
      <p>十五、你多学一样本事，就少说一句求人的话，现在的努力，是为了以后的不求别人，实力是最强的底气。记住，活着不是靠泪水博得同情，而是靠汗水赢得掌声。</p>
      <p>十六、决定一个人成就的，不是天分，也不是运气，而是坚持和付出，是不停地做，重复的做，用心去做。当你真的努力了，付出了，你会发现自己潜力无限！记得每天鼓励自己，越勤奋，越幸运，越感恩，越幸福！</p>
    </div>
  </page>
</template>

<script>
export default {
  name: 'PageDefaultFooter'
}
</script>

<style lang="less" scoped>
.content-wrap {
  padding: 0 20px;
  p {
    line-height: 50px;
  }
}
</style>
